#+TITLE: Caracterização dos dados
#+SUBTITLE: Yelp Dataset Challenge 2019
#+DATE: 5 de Agosto de 2019
#+AUTHOR: Heitor L. Werneck
#+LANGUAGE: pt
#+OPTIONS: toc:nil ^:nil
#+LATEX_HEADER: \usepackage[top=0.5cm,bottom=1.5cm,left=2cm,right=2cm]{geometry}
#+LATEX_HEADER: \usepackage[brazil]{babel}
#+latex_class_options: [9pt]
#+PROPERTY: header-args :eval never-export

A tabela [[tab:arqcampo]] mostra os campos e suas respectivas descrições em cada arquivo/objeto.

Os objetos tem um relacionamento logo dentre as possibilidades de bancos NoSQL, bancos relacionais tradicionais. O escolhido foi banco relacional mas um banco graph based seria interessante pela caracteristica schema-less do problema mas é mais complicado.

Em trabalhos futuros poderia ser usado um banco NoSQL graph based.(vide Neo4j)

Problemas

- par de amigos com redundancia. tabela friend. resolvido \checkmark
- business pode não ter categoria. resolvido \checkmark
- usuarios podem ter amigos que nao existem.
- esparsidade é pelo total de usuarios de cada cidade?? \checkmark

#+TBLNAME: tab:arqcampo
#+CAPTION: Arquivos e campo.
#+ATTR_LATEX: :align |l|l|p{12cm}|
|----------------+--------------------+-------------------------------------------------------------------------------------------------------------|
| Arquivo/Objeto | Campo              | Descrição                                                                                                   |
|----------------+--------------------+-------------------------------------------------------------------------------------------------------------|
| business.json  | business_id        | string, 22 character unique string business id                                                              |
| business.json  | name               | string, the business's name                                                                                 |
| business.json  | address            | string, the full address of the business                                                                    |
| business.json  | city               | string, the city                                                                                            |
| business.json  | state              | string, 2 character state code, if applicable                                                               |
| business.json  | postal code        | string, the postal code                                                                                     |
| business.json  | latitude           | float, latitude                                                                                             |
| business.json  | longitude          | float, longitude                                                                                            |
| business.json  | stars              | float, star rating, rounded to half-stars                                                                   |
| business.json  | review_count       | integer, number of reviews                                                                                  |
| business.json  | is_open            | integer, 0 or 1 for closed or open, respectively                                                            |
| business.json  | attributes         | object, business attributes to values. note: some attribute values might be objects                         |
| business.json  | categories         | an array of strings of business categories                                                                  |
| business.json  | hours              | an object of key day to value hours, hours are using a 24hr clock                                           |
| review.json    | review_id          | string, 22 character unique review id                                                                       |
| review.json    | user_id            | string, 22 character unique user id, maps to the user in user.json                                          |
| review.json    | business_id        | string, 22 character business id, maps to business in business.json                                         |
| review.json    | stars              | integer, star rating                                                                                        |
| review.json    | date               | string, date formatted YYYY-MM-DD                                                                           |
| review.json    | text               | string, the review itself                                                                                   |
| review.json    | useful             | integer, number of useful votes received                                                                    |
| review.json    | funny              | integer, number of funny votes received                                                                     |
| review.json    | cool               | integer, number of cool votes received                                                                      |
| user.json      | user_id            | string, 22 character unique user id, maps to the user in user.json                                          |
| user.json      | name               | string, the user's first name                                                                               |
| user.json      | review_count       | integer, the number of reviews they've written                                                              |
| user.json      | yelping_since      | string, when the user joined Yelp, formatted like YYYY-MM-DD                                                |
| user.json      | friends            | array of strings, an array of the user's friend as user_ids                                                 |
| user.json      | useful             | integer, number of useful votes sent by the user                                                            |
| user.json      | funny              | integer, number of funny votes sent by the user                                                             |
| user.json      | cool               | integer, number of cool votes sent by the user                                                              |
| user.json      | fans               | integer, number of fans the user has                                                                        |
| user.json      | elite              | array of integers, the years the user was elite                                                             |
| user.json      | average_stars      | float, average rating of all reviews                                                                        |
| user.json      | compliment_hot     | integer, number of hot compliments received by the user                                                     |
| user.json      | compliment_more    | integer, number of more compliments received by the user                                                    |
| user.json      | compliment_profile | integer, number of profile compliments received by the user                                                 |
| user.json      | compliment_cute    | integer, number of cute compliments received by the user                                                    |
| user.json      | compliment_list    | integer, number of list compliments received by the user                                                    |
| user.json      | compliment_note    | integer, number of note compliments received by the user                                                    |
| user.json      | compliment_plain   | integer, number of plain compliments received by the user                                                   |
| user.json      | compliment_cool    | integer, number of cool compliments received by the user                                                    |
| user.json      | compliment_funny   | integer, number of funny compliments received by the user                                                   |
| user.json      | compliment_writer  | integer, number of writer compliments received by the user                                                  |
| user.json      | compliment_photos  | integer, number of photo compliments received by the user                                                   |
| checkin.json   | business_id        | string, 22 character business id, maps to business in business.json                                         |
| checkin.json   | date               | string which is a comma-separated list of timestamps for each checkin, each with format YYYY-MM-DD HH:MM:SS |
| tip.json       | text               | string, text of the tip                                                                                     |
| tip.json       | date               | string, when the tip was written, formatted like YYYY-MM-DD                                                 |
| tip.json       | compliment_count   | integer, how many compliments it has                                                                        |
| tip.json       | business_id        | string, 22 character business id, maps to business in business.json                                         |
| tip.json       | user_id            | string, 22 character unique user id, maps to the user in user.json                                          |
| photo.json     | photo_id           | string, 22 character unique photo id                                                                        |
| photo.json     | business_id        | string, 22 character business id, maps to business in business.json                                         |
| photo.json     | caption            | string, the photo caption, if any                                                                           |
| photo.json     | label              | string, the category the photo belongs to, if any                                                           |
|----------------+--------------------+-------------------------------------------------------------------------------------------------------------|


#+BEGIN_SRC python :exports both :results output
  f=open("business.json")
  import json
  businessdataset=[]
  for line in f:
      businessdataset.append(json.loads(line))
  cities = set()

  for business in businessdataset:
      cities.add(business["city"])

  print("Número de cidades: " + str(len(cities)))
#+END_SRC

#+RESULTS:
: Número de cidades: 1204


Usuarios, POIs e cidades.

#+BEGIN_SRC sql :exports both :results output
select u.user_id,r.business_id,b.city from user AS u,review AS r,business AS b where u.user_id = r.user_id AND r.business_id=b.business_id LIMIT 10;
#+END_SRC

Cidades e quantidade de usuarios somente pelos reviews.

#+BEGIN_SRC sql :exports both :results output
-- citys and count of unique users, numeros de usuarios em cada cidade

SELECT city,COUNT(*) FROM
(SELECT DISTINCT u.user_id,b.business_id,b.city
FROM user AS u,review AS r,business AS b
WHERE u.user_id = r.user_id AND r.business_id=b.business_id) AS tab
GROUP BY city;

 -- SELECT DISTINCT u.user_id,b.business_id,b.city FROM user AS u,tip AS t,business AS b WHERE u.user_id = t.user_id AND t.business_id=b.business_id;
#+END_SRC


Cidades e quantidade de usuarios pelos reviews e tips.


#+BEGIN_SRC sql :exports both :results output :engine mysql :dbuser heitor :dbpassword "123" :database yelp :results verbatim
    -- cities and count of unique users, numeros de usuarios em cada cidade

SELECT city,COUNT(*) FROM
(
(SELECT DISTINCT u.user_id AS user_id,b.business_id AS business_id,b.city AS city
FROM user AS u,review AS r,business AS b WHERE u.user_id = r.user_id AND r.business_id=b.business_id)
UNION
(SELECT DISTINCT u.user_id AS user_id,b.business_id AS business_id,b.city AS city
FROM user AS u,tip AS t,business AS b WHERE u.user_id = t.user_id AND t.business_id=b.business_id)
) AS tab
GROUP BY city;


#+END_SRC

Esparsidade de cada poi usando o total de usuarios de cada cidade junto com a quantidade de usuarios em cada POI.

#+BEGIN_SRC sql :exports both :results output :engine mysql :dbuser heitor :dbpassword "123" :database yelp :results verbatim
	      -- esparsidade de cada cidade

  SELECT 1-t1.user_qnt_in_business/t2.user_qnt_in_city AS Sparsity,t1.business_id,t1.city FROM
  -- quantidade de usuarios em que fizeram algo em um certo business
  (SELECT business_id,count(business_id) AS user_qnt_in_business,city FROM
  (
  (SELECT DISTINCT u.user_id AS user_id,b.business_id AS business_id,b.city AS city
  FROM user AS u,review AS r,business AS b WHERE u.user_id = r.user_id AND r.business_id=b.business_id)
  UNION
  (SELECT DISTINCT u.user_id AS user_id,b.business_id AS business_id,b.city AS city
  FROM user AS u,tip AS t,business AS b WHERE u.user_id = t.user_id AND t.business_id=b.business_id)
  ) AS tab
  GROUP BY business_id) AS t1,
  -- quantidade de usuarios em cada cidade
  (SELECT city,COUNT(*) AS user_qnt_in_city FROM
  (
  (SELECT DISTINCT u.user_id AS user_id,b.business_id AS business_id,b.city AS city
  FROM user AS u,review AS r,business AS b WHERE u.user_id = r.user_id AND r.business_id=b.business_id)
  UNION
  (SELECT DISTINCT u.user_id AS user_id,b.business_id AS business_id,b.city AS city
  FROM user AS u,tip AS t,business AS b WHERE u.user_id = t.user_id AND t.business_id=b.business_id)
  ) AS tab
  GROUP BY city) AS t2

  WHERE t1.city = t2.city
#+END_SRC

Numero de POIs em cada cidade.

#+BEGIN_SRC sql :exports both :results output :engine mysql :dbuser heitor :dbpassword "123" :database yelp :results verbatim
-- numero de pois em cada cidade
 -- SELECT DISTINCT u.user_id,b.business_id,b.city FROM user AS u,tip AS t,business AS b WHERE u.user_id = t.user_id AND t.business_id=b.business_id;
    SELECT city,COUNT(*) FROM business GROUP BY city;
#+END_SRC

#+RESULTS:
#+begin_example
city	COUNT(*)
	1
110 Las Vegas	1
AGINCOURT	2
Ahwahtukee	1
Ahwatukee	19
Ahwatukee Foothills Village	1
Airdrie	168
Ajax	303
Akron	465
Alberta	1
Alburg	1
Alburgh	1
Aliquippa	1
Allegheny	1
Allentown	1
Allison Park	96
Ambridge	36
Amherst	105
Ange-Gardien	1
Anjou	20
Ansnorveldt	1
Anthem	26
Antioch	1
Apache Junction	26
Apache Trail	1
Arizona	1
Arnold	4
Arrowhead	1
Ashburn	2
Aspinwall	18
Auburn	1
Auburn Township	1
Auburn Twp	1
Aurora	356
Austin	1
Avalon	8
Avon	231
Avon Lake	123
Avondale	681
AZ	1
Baie-d'Urfé	3
Bainbridge	9
Bainbridge Township	1
Bakerstown	1
Baldwin	2
Ballantyne	1
Balzac	11
Banksville	1
Barberton	2
Bath	5
Bay Village	46
Beachwood	290
Beaconsfield	11
Beauharnois	2
Bedford	114
Bedford Heights	25
Bedford Hts	1
Bedford Hts.	1
Beeton	5
Belle Vernon	6
Belleville	14
Bellevue	41
Bellvue	5
Belmont	160
Beloeil	12
Beltline	1
Ben Avon	1
Bentleyville	1
Berea	121
Berry	1
Bethel Park	200
Black Earth	9
Black Rock City	1
Blainville	11
Blakeney	1
Blawnox	6
Bloomfield	2
Blue Diamond	12
Blue Mounds	1
Bois-des-Filion	3
Boisbriand	15
Bolton	44
Bond Head	1
Boston	1
Boston Heights	2
Boucherville	33
Boulder City	270
Braddock	11
Bradford	33
Bradford West Gwillimbury	19
Bradfordwoods	1
Brampton	1002
Bratenahl	3
Brecksville	81
Brentwood	18
Bridgeville	191
Broadlands	1
Broadview Heights	118
Broadview Hts	2
Brook Park	55
Brooklin	10
Brookline	2
Brooklyn	78
Brooklyn Heights	3
Brooklyn Hts.	1
Brookpark	16
Brossard	177
Brownsburg-Chatham	1
Brunswick	176
Brunswick Hills	1
Buckeye	69
Buckeye - Shaker	1
Buena Vista	1
Burlington	1
Burton	26
Bury	1
C Las Vegas	1
Caledon	33
Caledon East	9
Caledon Village	1
Calgary	7738
Candiac	3
Canonsburd	1
Canonsburg	163
Carefree	101
Carnegie	112
CARSON	1
Castle Shannon	15
Catawba Springs	1
Cave Creek	405
Cave Creek Road	1
Cecil	9
Centennial Hills	1
Central	1
Central City	1
Central City Village	2
Central Henderson	1
Central Oakland	1
Centre Island	1
Chagrin Falls	196
Chambly	13
Champaign	1262
Champlain	10
Chander	1
Chandler	4310
Chandler-Gilbert	1
Char	1
Chardon	87
Chargrin Falls	1
Charlemagne	1
Charlotte	9521
charlottte	1
Chatauguay	1
Chateau	1
Châteauguay	24
Chattanooga	1
Chertsey	1
Chesterland	67
Chestermere	31
Cheswick	29
Chomedey, Laval	1
Church Cove	1
Citibank	1
City Center	1
Clairton	16
Claremont	1
Clark	4
Clarkson	3
Cleveland	3606
Cleveland Heigh	1
Cleveland Height	1
Cleveland Heights	212
Cleveland Hghts.	1
Cleveland Hts.	1
Cleveland, OH	1
Clinton	1
Closter	1
Clover	46
Columbia Sta	1
Columbia Station	27
Columbus	1
Communauté-Urbaine-de-Montréal	2
Concord	992
Concord Mills	4
Concord Township	5
Concord Twp	2
Cooksville	2
Copley	37
Coraopolis	170
Cornelius	474
Cote Saint Luc	1
Cote Saint-Luc	10
Cote-Saint-Luc	5
Coteau-du-Lac	2
Cottage Grove	37
Crafton	12
Cramerton	12
Cranberry Township	1
Cranberry Twp	1
Creighton	3
Crescent	1
Cross Plains	24
Crouse	1
Cuddy	2
Cuyahoga Falls	354
Cuyahoga Fls	3
Cuyahoga Heights	2
Cuyohoga Falls	1
Dallas	28
Dane	6
Darlington	1
Davidson	108
De Forest	26
De l'Eglise	1
De Winton	1
Decatur	1
Deerfield	2
DeForest	28
Delson	7
Denver	116
Desert Ridge	1
Deux-Montagnes	1
Deux-Montagnes Regional County Municipality	2
Dewey	1
Division No. 6	3
Dollard-des Ormeaux	8
Dollard-des-Ormeaux	115
Don Mills	4
Dormont	8
Dorval	97
Down	1
Downsview	2
Downtown	5
Downtown Toronto	4
Draper	1
Dravosburg	10
Dublin	1
Duquesne	6
Durham Regional Municipality	2
East Ajax	1
East Calgary	1
East Cleveland	7
East Credit	1
East Gwilimbury	1
East Gwillimbury	27
East Hawkesbury	1
East Liberty	3
East Mc Keesport	3
East McKeesport	5
East Mesa	1
East Mississauga	2
East Pittsburgh	6
East York	161
Eastlake	74
Edgemont	1
Edgewood	2
Edmonton	2
Eighty Four	2
El Mirage	122
Elizabeth	35
Elizabeth Township	1
Elrama	1
Elyria	208
Emsworth	3
Enterprise	7
Erie	2
Estérel	1
Estrella Village	1
Etibicoke	1
Etna	12
Etobicoke	795
Etobicoke,	1
Etobiicoke	2
Euclid	106
Evergreen	1
Export	5
Fabreville	1
Fairlawn	157
Fairport Harbor	6
Fairview Park	106
Farmington	1
Farnham	2
Finleyville	21
Fisher	2
Fitchburg	201
Fitchburgh	1
Fithian	1
Forest Hills	3
Fort  Mill	1
Fort Mcdowell	14
Fort Mill	630
Fountain Hills	345
Fountain Hls	1
Fox Chapel	1
Franklin Park	2
Frazer	1
Ft. Mill	2
Garfield Heights	50
Garfield Hts	2
Garrettsville	1
Gastonia	481
Gates Mills	4
Geauga	2
Gelndale	1
Georgetown	32
Gibsonia	113
Gifford	2
Gilbert	3465
Glassport	6
Glbert	1
Glen Williams	1
Glendale	3546
Glendale Az	1
Glenshaw	51
Godmanchester	1
Goodwood	2
Goodyear	856
Gormley	5
Grafton	16
Grand Canyon	1
Grand River	2
Green Tree	1
Green Valley	1
Greenfield Park	20
Greensboro	1
Greenway	1
Grove City	1
Guadalupe	25
Halton Hills	30
Hamilton	1
Hampstead	1
Hampton Township	13
Harmar Township	1
Harmarville	5
Harrisbug	1
Harrisburg	123
Harrisburg,	1
Harrison City	7
Harwick	1
Heidelberg	12
Hemmingford	2
Henderson	4903
Henderson (Green Valley)	1
Henderson and Las vegas	1
Henderson Nevada	1
Hendersonville	1
Henderston	1
Hendserson	1
Henryville	1
Herminie	5
Highland Heights	38
Highland Hills	3
Highland Hts	1
Highland Park	1
Higley	25
Hinckley	19
Hiram	7
Hnederson	1
Holland Landing	4
Homer	4
Homestead	119
Hudson	203
Huntersville	625
Huntingdon	1
Huntington Beach	1
Huntsburg	2
Hyland Heights	1
Iberville	1
Île des Soeurs	1
Île-des-Soeurs	1
Imperial	21
Independence	143
Indian Land	78
Indian Land,	1
Indian Trail	301
Indianola	1
Inglewood	1
Ingomar	2
Ingram	1
Irwin	74
Ivesdale	1
Jefferson Hills	14
Joliet	1
Joliette	6
Kahnawake	5
Kannapolis	100
Kennedy Township	3
Kent	254
Kettleby	2
King	5
King City	20
Kirkland	47
Kirtland	19
Kleinburg	9
L'Assomption	2
L'ile-Bizard	4
L'ile-Perrot	14
La Prairie	21
La Salle	7
La Vegas	2
Lachenaie	2
Lachine	54
Lachute	7
Lacolle	1
LaGrange	9
Lake Las Vegas	1
Lake Mead	1
Lake Norman	1
Lake Park	2
Lake Wylie	53
Lakewood	519
Lakewood, Oh	1
Lancaster	3
Las  Vegas	5
Las Vegas	29416
Las Vegas & Henderson	1
Las Vegas East	1
Las Vegas Nevada	1
Las Vegas NV	2
Las Vegas Valley	1
Las Vegas,	1
Las Vegas, NV	2
Las Vegass	1
Las Vergas	1
Lasalle	92
LasVegas	2
Laval	394
Laval, Pont Viau	1
Laval, Ste Dorothee	1
Lavaltrie	1
Laveen	128
Laveen Village	15
Lawrence	1
Lawrenceville	4
Le Haut-Saint-Laurent Regional County Municipality	1
Le Sud-Ouest	1
Leaside	1
Leeds	2
Leetsdale	13
Les Cèdres	1
Les Coteaux	1
Leslieville	1
Library	4
Lindale	1
Litchfield	11
Litchfield Park	223
Locust	13
Lodi	1
London	1
Longueuil	78
Lorain	113
Los Angeles	2
Los Vegas	1
Lowell	14
Lower Burrell	23
Lower Lawrenceville	1
Lowesville	2
Lufkin	1
Lyndhurst	119
Lynhurst	1
Macedonia	100
Madison	3495
Mahomet	42
Malton	2
Manchester	1
Mansfield	1
Mantua	15
Maple	59
Maple Grove	1
Maple Heights	52
Maricopa	1
Markham	1767
Markham, ON	1
Marshall	3
Marvin	3
Mascouche	5
Mathews	2
Mattews	1
Matthews	750
Mayfield	18
Mayfield Heights	162
Mayfield Heights (Cleveland)	1
Mayfield Heights.	1
Mayfield Hts	2
Mayfield Hts.	1
Mayfield Village	10
Mc Adenville	1
Mc Donald	7
Mc Farland	31
Mc Kees Rocks	37
Mc Murray	12
McAdenville	4
McCandless	6
McCandless Township	8
McDonald	10
McFarland	31
McKees Rocks	71
McKeesport	68
McKeesRocks	1
Mcknight	2
McMasterville	1
McMurray	101
McMurry	3
Median	1
Medicine Hat	1
Medina	348
Medina Township	3
Mentor	472
Mentor On the	6
Mentor On The Lake	11
Mentor-On-The-Lake	10
Mercier	2
Mesa	6089
Mesa Arizona	1
Mesa AZ	1
Metro Phoenix	1
Middleburg	1
Middleburg Heights	139
Middleburg Hts	6
Middleburg Hts.	1
Middlefield	28
Middleton	360
Midland	20
Midnapore	1
Midway	1
Milford	1
Millvale	19
Milton	14
Mint  Hill	1
Mint Hill	110
Mirabel	6
Missisauga	4
Mississagua	1
Mississauaga	1
Mississauga	3112
Mississauge	1
Mississaugua	1
Mississuaga	1
Monona	137
Monongahela	16
Monoroeville	2
Monreoville	1
Monroe	175
Monroeville	401
Mont St-hilaire	1
Mont-Royal	31
Mont-Saint-Grégoire	4
Mont-Saint-Hilaire	9
Montéal	1
Monterey Park	1
Montgomery	1
Monticello	36
Montral	2
Montreal	6604
Montréal (Québec)	1
Montreal-Est	2
Montréal-Nord	10
Montréal-Ouest	8
Montreal-Quest	1
Montreal-West	4
Montrose	2
Montville	1
Mooers	1
Moon	10
Moon Township	47
Moon Twp	3
Moon Twp.	1
Mooresville	45
Moreland Hills	10
Morgan	2
Morgan Hill	1
Morin-Heights	6
Moseley	1
Mount Albert	5
Mount Holly	48
Mount Horeb	52
Mount Lebanon	15
Mount Oliver	1
Mount Washington	1
Mt Holly	2
Mt Lebanon	8
Mt. Holly	2
Mt. Horeb	1
Mt. Lebanon	7
Mt. Washington	1
Munhall	31
Munroe Falls	20
Murrysville	111
Murrysville (Monroeville)	1
N E Las Vegas	1
N Las Vegas	26
N Ridgeville	3
N Solon	1
N W Las Vegas	1
N. Las Vegas	12
N. Olmsted	2
N. Randall	1
N. Ridgeville	1
Napierville	2
Nationwide	1
Nellis	1
Nellis AFB	20
Nellis Air Force Base	4
Nevada	1
Neville Island	2
New Eagle	4
New Glarus	1
New Kensington	81
New River	2
New Tecumseth	1
New York	1
Newburgh Heights	1
Newbury	19
Newmarket	353
Nobleton	10
North  Ridgeville	1
North  York	1
North Braddock	2
North Carolina	1
North Charlotte	1
North Hills	2
North Huntingdon	38
North Huntington	2
North Las Vegas	1550
North of Brampton	1
North Olmstead	2
North Olmsted	396
North Olmsted,	1
North Phoenix	1
North Randall	9
North Ridgeville	97
North Royalton	157
North Scottsdale	1
North Strabane Township	1
North Toronto	1
North Versailles	63
North York	1207
Northeast Calgary	1
Northfield	91
Northfield Center	4
Northfield Center Township	2
Northwest Calgary	3
NorthYork	2
Norton	10
Norval	1
Notre-Dame-de-l'Ile-Perrot	2
Nottingham Township	1
Novelty	5
Noyan	2
O'hara Township	1
Oak Ridges	2
Oakdale	48
Oakland	4
Oakmont	54
Oakridges	1
Oakville	363
Oakwood	4
Oakwood Village	13
Oberlin	5
Ogden	6
Oka	6
Old Brooklyn	1
Old Port of Montreal	1
Old Scottsdale	1
Old Town Scottsdale	2
Oldham	1
Olmsted Falls	47
Olmsted Township	6
Omaha	1
Orange	12
Orange Village	10
Oregon	76
Ormstown	2
Oshawa	1
Otterburn Park	1
Outremont	38
Pahrump	1
Painesville	132
Painesville Township	2
Palgrave	1
Paoli	3
Paradise	24
Paradise Valley	136
Parma	290
PARMA HEIGHTS	70
Parma mid birth	1
Pasadena	1
Paw Creek	1
Peninsul	1
Peninsula	29
Penn Hills	33
Penn Hills Township	1
Pennsylvania	1
Peoria	1921
Pepper Pike	19
Pepperpike	1
Perry	6
Perry Twp	1
Peters Township	2
Pgh Int Arprt	1
Pheonix	3
Pheonix AZ	1
Philo	3
Phoeniix	1
Phoenix	18782
Phoenix AZ	1
Phoenix Metro Area	2
Phoenix Valley	1
Phoenix,	1
Phoenix, AZ	2
Phoenx	1
Phoneix	1
Phoniex	1
Phx	1
Pickering	326
Pickering Ajax Whitby	1
Piedmont	4
Pierrefonds	50
Pincourt	2
Pine	1
Pineville	349
Pitcairn	5
Pittsburch	1
Pittsburg	8
Pittsburgh	7019
Pleasant Hills	36
Plum	19
Plum Boro	2
Point-Claire	1
Pointe Claire	3
Pointe-Aux-Trembles	6
Pointe-Calumet	2
Pointe-Claire	102
Port Credit	4
Port Vue	1
Presto	5
Prévost	2
Promenade	1
Puyallup	1
Quartier des Spectacles	1
Québec	1
Queen Creek	102
Queensville	1
Rainbow Valley	1
Rankin	2
Ranlo	1
Rantoul	50
Ravenna	14
Rawdon	3
Red Mountain	1
Red Rock	1
Regent Square	1
Regional Municipality of York	1
Reminderville	1
Repentigny	3
Rexdale	5
Richfield	45
Richland Township	1
Richmond Height	1
Richmond Heights	27
Richmond Hil	1
Richmond Hill	1027
Richmond Hts	3
Richmonhill	1
Rigaud	4
Rillton	2
Rio Verde	5
River Drive Park	1
Robinson	11
Robinson Township	22
Robinson Twp.	1
Rock Hill	311
Rock Hill SC	1
Rockey View	1
Rocky River	246
Rocky View	20
Rocky View County	9
Rocky View No. 44	4
Rockyview	2
Rockyview County	1
Rosemère	26
Ross	2
Ross Township	7
Rostraver	1
Rougemont	1
Rouses Point	7
Roxboro	2
Rural Ridge	1
Russell Twp	1
Russellton	4
S Concord	1
Sacramento	1
Sagamore Hills	9
Sage Hill	1
Saint - Hyacinthe	1
Saint Joseph	17
Saint Laurent	2
Saint Leonard	1
Saint-Basile-le-Grand	2
Saint-Bernard de Lacolle	1
Saint-Bernard-de-Lacolle	3
Saint-Bruno	4
Saint-Bruno-de-Montarville	6
Saint-Charles-Borromee	2
Saint-Constant	6
Saint-Eustache	19
Saint-Henri	1
Saint-Hippolyte	2
Saint-Hubert	23
Saint-Hyacinthe	11
Saint-Isidore-de-Laprairie	1
Saint-Jean-Sur-Richelieu	33
Saint-Jérôme	27
Saint-Lambert	22
Saint-Laurent	137
Saint-Lazare	8
Saint-Leonard	40
Saint-Marc-sur-Richelieu	2
Saint-Philippe	2
Saint-Pie	1
Saint-Pierre-de-Véronne-à-Pike-River	1
Saint-Roch-de-l'Achigan	1
Saint-Sauveur	50
Saint-Sauveur-des-Monts	2
Sainte-Adèle	17
Sainte-Anne-de-Bellevue	25
Sainte-Anne-des-Plaines	2
Sainte-Catherine	4
Sainte-Dorothée	1
Sainte-Genevieve	5
Sainte-Julie	16
Sainte-Madeleine	1
Sainte-Marguerite-du-lac-Masson	2
Sainte-Marguerite-Esterel	1
Sainte-Marthe	1
Sainte-Rose	1
Sainte-Thérèse	15
Sainte-Thérèse-de-Blainville	1
Saintt-Bruno-de-Montarville	1
Salaberry-De-Valleyfield	6
Sale	1
San Diego	1
San Tan	1
San Tan Valley	2
Sandy Ridge	1
Sauk City	2
Savoy	79
Scarborough	1104
Scarbrough	2
Scarobrough	1
Schaumburg	1
Schomberg	10
Schottsdale	1
Scotesdale	1
Scotsdale	1
Scottadale	1
Scottdale	3
Scottsale	1
Scottsdale	8845
Scottsdale, AZ	1
Seattle	1
Sedona	1
Seven Hills	34
Sewickley	115
Shady Side	1
Shadyside	4
Shaker Heights	66
Shaker Hts	2
Shaler	1
Shaler Township	2
Sharon	1
Sharpsburg	9
Sheffield	11
Sheffield Lake	14
Sheffield Village	29
Shorewood Hills	2
Side Slopes	1
Sidney	3
Silver Lake	2
Snowflake	1
Solon	213
Somerton	1
South Amherst	1
South Charlotte	1
South Euclid	80
South Hills	2
South Las Vegas	4
South Park	11
South Park Township	8
South Russell	1
Southeast Calgary	3
Southside Flats	1
Spartanburg	1
Spring Hill City View	1
Spring Valley	9
Springdale	14
Squirrel Hill	3
St Joseph	2
St Leonard	2
St-Benoît de Mirabel	1
St-Bruno-de-Montarville	3
St-Clet	1
St-Jean-sur-Richelieu	1
St-Jerome	3
St-Laurent	1
St-Lazare	1
St-Leonard	5
St. Jean Sur Richelieu	1
St. Joseph	1
St. Leonard	2
St. Sauveur	1
St.Pittsburgh	1
Stallings	22
Stanley	19
Ste-Dorothée	1
Ste-Rose	1
Ste-Therese-de-Blainville	1
Stetson Valley	1
Stouffville	60
Stoughton	115
Stow	234
Streetsboro	137
Streetsville	3
Strip District	1
Strongsville	379
Strongville	1
Sturgeon	2
Summerlin	11
Summerlin South	2
Sun City	259
Sun City West	104
Sun Lakes	31
Sun Praiie	1
Sun Prairie	247
Suncity	1
Sunnyslope	1
Sunrise	1
Sunrise Manor	1
Suprise	1
Surprise	1150
Surprise Crossing	1
Sutersville	2
SW Calgary	1
Swissvale	9
Tallmadge	53
Tampa	1
Tarentum	55
Tega Cay	31
Temecula	1
Tempe	4557
Terrebonne	17
The Promenade	1
Thomasboro	1
Thorncliffe Park	1
Thornhil	1
Thornhill	397
Tolleson	148
Tolono	1
Tornto	1
Toronto	18911
Toronto Division	1
Toronto Scarborough	1
Toronto-Etobicoke	1
Toronto-North York	1
Toronto-West	1
Tottenham	4
Township of Concord	1
Trafford	16
Tremont	2
Troy Township	1
Tucson	1
Turtle Creek	18
Tuscola	2
Twinsburg	130
Twinsburgh	1
Union	1
Unionville	49
University	1
University Heights	42
University Ht	1
University Hts 	1
Upper Saint Clair	9
Upper St Clair	6
Upper St. Clair	6
Uptown	1
Urbana	411
Urbana, Illinois	1
Uxbridge	10
Val-Morin	2
Valencia	1
Valley City	16
Valley View	24
Valleywide	1
Varennes	1
Vaudreuil	2
Vaudreuil-Dorion	67
Vaughan	919
Vaughan Mills	1
Vaughn	1
Vegas	1
Venetia	7
Venise-en-Québec	1
Verdun	154
Verona	198
Vieux-Montréal	1
Villa Grove	1
Ville Mont-Royal	1
Ville Saint Laurent	1
Vimont	6
W Henderson	1
W Spring Valley	1
Waddell	19
Wadsworth	26
Walton Hills	5
Warrendale	1
Warrensville	2
Warrensville Heights	45
Warrensville Hts	3
Warrensville Hts.	1
Warrenville	1
Waterloo	1
Waunakee	86
Waxhaw	170
Weddington	11
Wellington	1
Wesley Chapel	21
West Elizabeth	2
West Homestead	19
West Lake	1
West Mifflin	145
West Montréal	1
West Toronto	1
West View	16
Westlake	389
Westmount	97
Weston	3
Westport	1
Westview	1
Westworld Scottsdale	1
Wexford	280
Whiitby	1
Whitby	276
Whitchurch-Stouffville	47
White Oak	34
Whitney	1
Whtiby	1
Wickliffe	72
Wildwood	3
Wilkens Township	1
Wilkins Township	1
Wilkinsburg	13
Willoughby	257
Willoughby Hills	48
Willowdale	8
Willowick	69
Wilmerding	11
Windsor	15
Woodbridge	241
Woodbridge (Vaughan)	1
Woodmere	60
Woodmere Village	2
York	116
York Regional Municipality	2
Yorkdale	1
Yorkville	1
Youngtown	65
Zephyr	1
#+end_example



